In [1]:
import pandas as pd

# 데이터
df = pd.read_csv("../../dataset/basic1.csv")
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

---
## User Code

1. 첫번째 데이터 부터 순서대로 50:50으로 데이터를 나누고, 앞에서 부터 50%의 데이터(이하, A그룹)는 'f1'컬럼을 A그룹의 중앙값으로 채우고, 뒤에서부터 50% 데이터(이하, B그룹)는 'f1'컬럼을 B그룹의 최대값으로 채운 후, A그룹과 B그룹의 표준편차 합을 구하시오

- 단, 소수점 첫째자리까지 구하시오 (둘째자리에서 반올림)

2. 'f4'컬럼을 기준 내림차순 정렬과 'f5'컬럼기준 오름차순 정렬을 순서대로 다중 조건 정렬하고나서 앞에서부터 10개의 데이터 중 'f5'컬럼의 최소값 찾고, 이 최소값으로 앞에서 부터 10개의 'f5'컬럼 데이터를 변경함. 그리고 'f5'컬럼의 평균값을 계산함

- 단 소수점 둘째자리까지 출력(셋째자리에서 반올림)

'age' 컬럼의 IQR방식을 이용한 이상치 수와 표준편차*1.5방식을 이용한 이상치 수 합을 구하시오
IQR방식 : Q1 - 1.5 IQR, Q3 + 1.5 IQR에서 벗어나는 영역을 이상치라고 판단함 (Q1은 데이터의 25%, Q3는 데이터의 75% 지점임)
표준편차1.5방식: 평균으로부터 '표준편차1.5'를 벗어나는 영역을 이상치라고 판단함

---
## Solution

1. 첫번째 데이터 부터 순서대로 50:50으로 데이터를 나누고, 앞에서 부터 50%의 데이터(이하, A그룹)는 'f1'컬럼을 A그룹의 중앙값으로 채우고, 뒤에서부터 50% 데이터(이하, B그룹)는 'f1'컬럼을 B그룹의 최대값으로 채운 후, A그룹과 B그룹의 표준편차 합을 구하시오

- 단, 소수점 첫째자리까지 구하시오 (둘째자리에서 반올림)

In [2]:
df.shape

(100, 8)

In [3]:
a = df[:50]
b = df[50:]
a.shape, b.shape

((50, 8), (50, 8))

In [4]:
a['f1'].isnull().sum(), b['f1'].isnull().sum()

(15, 16)

In [5]:
a['f1'].median(), b['f1'].max()

(68.0, 111.0)

In [6]:
a.loc[:,'f1'] = a['f1'].fillna(a['f1'].median())
b.loc[:,'f1'] = b['f1'].fillna(b['f1'].max())

/tmp/ipykernel_2000/1689482941.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  a.loc[:,'f1'] = a['f1'].fillna(a['f1'].median())
/tmp/ipykernel_2000/1689482941.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  b.loc[:,'f1'] = b['f1'].fillna(b['f1'].max())

In [7]:
a['f1'].isnull().sum(), b['f1'].isnull().sum()

(0, 0)

In [8]:
round(a['f1'].std() + b['f1'].std(), 1)

42.0

---
2. 'f4'컬럼을 기준 내림차순 정렬과 'f5'컬럼기준 오름차순 정렬을 순서대로 다중 조건 정렬하고나서 앞에서부터 10개의 데이터 중 'f5'컬럼의 최소값 찾고, 이 최소값으로 앞에서 부터 10개의 'f5'컬럼 데이터를 변경함. 그리고 'f5'컬럼의 평균값을 계산함

- 단 소수점 둘째자리까지 출력(셋째자리에서 반올림)

In [9]:
df = pd.read_csv("../../dataset/basic1.csv")
df = df.sort_values(['f4', 'f5'], ascending=[False, True]).reset_index(drop=True)
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id43  23.0   대구  60.0   0  NaN  ISTP  29.269869
1  id70  -9.0   경기  96.0   1  NaN  ISTP  48.431184
2  id17  74.0   서울   NaN   1  NaN  ISTP  67.886373
3  id23  34.0   부산  75.0   1  NaN  ISTP  69.730313
4  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986

In [10]:
f5_min = df[:9]['f5'].min()
f5_min

17.25298557

In [11]:
df.iloc[:10,7] = f5_min
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id43  23.0   대구  60.0   0  NaN  ISTP  17.252986
1  id70  -9.0   경기  96.0   1  NaN  ISTP  17.252986
2  id17  74.0   서울   NaN   1  NaN  ISTP  17.252986
3  id23  34.0   부산  75.0   1  NaN  ISTP  17.252986
4  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986

In [12]:
round(df['f5'].mean(), 2)

53.63

---
3. 'age' 컬럼의 IQR방식을 이용한 이상치 수와 표준편차*1.5방식을 이용한 이상치 수 합을 구하시오
- IQR방식 : Q1 - 1.5 IQR, Q3 + 1.5 IQR에서 벗어나는 영역을 이상치라고 판단함 (Q1은 데이터의 25%, Q3는 데이터의 75% 지점임)
- 표준편차1.5방식: 평균으로부터 '표준편차1.5'를 벗어나는 영역을 이상치라고 판단함

In [13]:
df = pd.read_csv("../../dataset/basic1.csv")

In [14]:
q1 = df['age'].quantile(.25)
q3 = df['age'].quantile(.75)
q1, q3

(26.875, 77.0)

In [15]:
iqr = q3 - q1
iqr_out = df[(df['age'] < (q1 - 1.5 * iqr)) | (df['age'] > (q3 + 1.5 * iqr))]
iqr_out.shape

(0, 8)

In [16]:
m = df['age'].mean()
s = df['age'].std()
std_out = df[(df['age'] < m - 1.5 * s) | (df['age'] > m + 1.5 * s)]
std_out.shape

(14, 8)

In [17]:
len(iqr_out) + len(std_out)

14